# あなたは、全ての辺の長さ
#   整数である直角三角形を
#     数えることになりました。
#
#     すべての辺が整数の直角三角形は無限
#     数えられない
#
# しかし、この条件を満たす三角形全てを数えるときりがない
#   ので、以下の条件を満たす三角形だけ
#     を数えることにしました。
#
# ・調べる直角三角形は直角が右下にある。
#   - 右下に直角
#
# ・全ての辺は整数である。
#   - 整数
#
# ・ある与えられた二つの整数 M, N が与えられ、
#   M より長さが小さい底辺、
#     - M > 底辺
#
#   N より長さが小さい高さをもつ。
#     - N > 高さ
#
#  出力
#  斜辺も整数である直角三角形の個数を整数で出力してください。
#    - 斜辺、高さ、底辺すべて整数である直角三角形の個数
#  出力最終行の末尾に改行
#    を入れ、余計な文字、
#    空行を含んではいけません。
#
#


#   すべての辺が整数の直角三角形は無限
#   整数である直角三角形を
#     数えることになりました。
# しかし、この条件を満たす三角形全てを数えるときりがない

# ・調べる直角三角形は直角が右下にある。
#   - 右下に直角
# ・全ての辺は整数である。
#   - 整数
# ・ある与えられた二つの整数 M, N が与えられ、
#   M より長さが小さい底辺、
#     - M > 底辺
#
#   N より長さが小さい高さをもつ。
#     - N > 高さ
#  出力
#  斜辺も整数である直角三角形の個数を整数で出力してください。
#    - 斜辺、高さ、底辺すべて整数である直角三角形の個数

# すべての辺が整数の直角三角形を数えたい
# 右下に直角？
# すべて整数
# M,Nが与えられ、それぞれ底辺、高さがそれより小さい
hen = int

# pending
